[
  {
    "id": "no_precipitate_no_gas_no_water",
    "type": "exchange_reaction_condition",
    "condition_ru": "Реакция обмена не идёт, если не образуется осадок, газ или вода (слабый электролит)",
    "description_ru": "Реакции ионного обмена протекают до конца только при выполнении хотя бы одного из условий: образование осадка, выделение газа, образование воды (слабого электролита)."
  },
  {
    "id": "insoluble_base_no_acid_reaction",
    "type": "exchange_reaction_condition",
    "condition_ru": "Нерастворимое основание не реагирует с солью другого нерастворимого основания",
    "description_ru": "Для реакции обмена между основанием и солью оба исходных вещества должны быть в растворе (хотя бы одно) или одно из них растворимо."
  },
  {
    "id": "noble_metal_no_acid",
    "type": "activity_series_condition",
    "condition_ru": "Металлы, стоящие в ряду активности после водорода, не вытесняют водород из разбавленных кислот",
    "description_ru": "Cu, Hg, Ag, Pt, Au не реагируют с разбавленными кислотами (HCl, H₂SO₄ разб.) с выделением водорода."
  },
  {
    "id": "less_active_no_displacement",
    "type": "activity_series_condition",
    "condition_ru": "Менее активный металл не вытесняет более активный из раствора его соли",
    "description_ru": "Металл может вытеснить другой металл из раствора его соли, только если он расположен в ряду активности левее вытесняемого металла."
  },
  {
    "id": "alkali_metal_water_not_salt",
    "type": "activity_series_condition",
    "condition_ru": "Щелочные и щёлочноземельные металлы реагируют с водой, а не с солями в растворе",
    "description_ru": "Li, Na, K, Ca, Ba при добавлении в раствор соли прежде всего реагируют с водой, а не вытесняют металл из соли."
  },
  {
    "id": "sio2_no_water",
    "type": "oxide_reaction_condition",
    "condition_ru": "SiO₂ не реагирует с водой",
    "description_ru": "В отличие от большинства кислотных оксидов, оксид кремния(IV) не растворяется в воде и не образует кремниевую кислоту при взаимодействии с H₂O."
  },
  {
    "id": "insoluble_base_heat_decomposition",
    "type": "thermal_condition",
    "condition_ru": "Нерастворимые основания при нагревании разлагаются на оксид металла и воду",
    "description_ru": "Cu(OH)₂, Fe(OH)₃, Al(OH)₃ и другие нерастворимые основания при нагревании разлагаются. Щёлочи термически устойчивы."
  },
  {
    "id": "carbonate_acid_gas",
    "type": "gas_forming_condition",
    "condition_ru": "Карбонаты и гидрокарбонаты при действии кислот выделяют CO₂",
    "description_ru": "При взаимодействии карбонатов (CO₃²⁻) с кислотами промежуточно образуется H₂CO₃, которая немедленно разлагается на CO₂ и H₂O."
  },
  {
    "id": "sulfite_acid_gas",
    "type": "gas_forming_condition",
    "condition_ru": "Сульфиты при действии кислот выделяют SO₂",
    "description_ru": "При взаимодействии сульфитов (SO₃²⁻) с кислотами промежуточно образуется H₂SO₃, которая разлагается на SO₂ и H₂O."
  },
  {
    "id": "sulfide_acid_gas",
    "type": "gas_forming_condition",
    "condition_ru": "Растворимые сульфиды при действии кислот выделяют H₂S",
    "description_ru": "Растворимые сульфиды при взаимодействии с кислотами выделяют сероводород H₂S (газ с запахом тухлых яиц)."
  },
  {
    "id": "ammonium_alkali_gas",
    "type": "gas_forming_condition",
    "condition_ru": "Соли аммония при действии щелочей выделяют NH₃",
    "description_ru": "При взаимодействии солей аммония с щелочами промежуточно образуется NH₃·H₂O, который разлагается с выделением аммиака NH₃."
  },
  {
    "id": "h2so4_conc_oxidizer",
    "type": "special_acid_condition",
    "condition_ru": "Концентрированная H₂SO₄ — сильный окислитель, реагирует иначе, чем разбавленная",
    "description_ru": "Концентрированная серная кислота окисляет металлы (в том числе Cu) за счёт S(+6), а не H(+1). Продукты восстановления: SO₂, S, H₂S."
  },
  {
    "id": "hno3_oxidizer",
    "type": "special_acid_condition",
    "condition_ru": "HNO₃ любой концентрации — окислитель; водород не выделяется",
    "description_ru": "Азотная кислота окисляет металлы за счёт N(+5), а не H(+1). Водород никогда не выделяется. Продукты восстановления зависят от концентрации и активности металла."
  },
  {
    "id": "passivation_cold_conc",
    "type": "passivation_condition",
    "condition_ru": "Fe, Al, Cr пассивируются холодными концентрированными H₂SO₄ и HNO₃",
    "description_ru": "Железо, алюминий и хром покрываются плотной оксидной плёнкой при контакте с холодной концентрированной серной или азотной кислотой (пассивация). Реакция не идёт."
  },
  {
    "id": "amphoteric_both_directions",
    "type": "amphoteric_condition",
    "condition_ru": "Амфотерные оксиды и гидроксиды реагируют и с кислотами, и с щелочами",
    "description_ru": "Al₂O₃, ZnO, BeO, Al(OH)₃, Zn(OH)₂, Be(OH)₂ проявляют двойственные свойства: с кислотами ведут себя как основания, со щелочами — как кислоты."
  }
]
