{
  "theory_blocks": [
    {
      "id": "aufbau",
      "title_ru": "Принцип наименьшей энергии (правило Клечковского)",
      "text_ru": "Электроны заполняют атомные орбитали в порядке возрастания их энергии. Согласно правилу Клечковского, первыми заполняются подуровни с наименьшей суммой (n + l), где n — главное квантовое число, а l — орбитальное. При одинаковой сумме (n + l) первым заполняется подуровень с меньшим значением n. Например, подуровень 4s (n + l = 4) заполняется раньше 3d (n + l = 5), а 3d раньше 4p (n + l = 5, но n меньше у 3d).",
      "order_hint": "1s → 2s → 2p → 3s → 3p → 4s → 3d → 4p → 5s → 4d → 5p → 6s → 4f → 5d → 6p → 7s → 5f → 6d → 7p"
    },
    {
      "id": "hund",
      "title_ru": "Правило Хунда",
      "text_ru": "При заполнении орбиталей одного подуровня (вырожденных орбиталей) электроны сначала занимают свободные орбитали по одному с параллельными спинами и лишь затем начинают спариваться. Это объясняется тем, что электроны с одинаковыми спинами на разных орбиталях сильнее удалены друг от друга, что уменьшает их взаимное отталкивание и понижает энергию атома. Таким образом, суммарный спин электронов подуровня максимален в основном состоянии атома."
    },
    {
      "id": "pauli",
      "title_ru": "Принцип запрета Паули",
      "text_ru": "В одном атоме не может быть двух электронов с одинаковым набором всех четырёх квантовых чисел. Это означает, что на каждой орбитали может находиться не более двух электронов, причём с противоположными (антипараллельными) спинами. Отсюда следует максимальная ёмкость подуровней: s-подуровень вмещает 2 электрона (1 орбиталь), p — 6 (3 орбитали), d — 10 (5 орбиталей), f — 14 (7 орбиталей)."
    },
    {
      "id": "exceptions",
      "title_ru": "Провал электрона",
      "text_ru": "У некоторых элементов реальная электронная конфигурация отличается от предсказанной правилом Клечковского. Наиболее известные случаи — хром (Cr) и медь (Cu): вместо ожидаемых 4s²3d⁴ и 4s²3d⁹ их реальные конфигурации 4s¹3d⁵ и 4s¹3d¹⁰ соответственно. Причина в том, что наполовину и полностью заполненные d-подуровни обладают повышенной устойчивостью благодаря дополнительной энергии обменного взаимодействия между электронами с параллельными спинами. Аналогичные «провалы» наблюдаются и в других переходных металлах (Mo, Ag, Au, Pt и др.)."
    },
    {
      "id": "valence",
      "title_ru": "Валентные электроны",
      "text_ru": "Валентные электроны — это электроны, участвующие в образовании химических связей. У элементов главных подгрупп (s- и p-элементов) это электроны внешнего энергетического уровня. У элементов побочных подгрупп (d-элементов) валентными являются электроны внешнего уровня (ns) и предвнешнего d-подуровня ((n−1)d). Число валентных электронов определяет возможные степени окисления элемента и его химические свойства."
    }
  ],
  "oxidation_explanation_template_ru": "Элемент {symbol} ({name_ru}) имеет конфигурацию валентных электронов {valence_config}. Всего {valence_count} валентных электронов. Возможные степени окисления: {ox_states}.",
  "competency_descriptions": {
    "periodic_table": {
      "name_ru": "Периодическая таблица",
      "description_ru": "Умение находить элемент в таблице Менделеева по номеру, символу или названию. Понимание связи между положением элемента (период, группа, подгруппа) и его свойствами: металличность, электроотрицательность, радиус атома, типичные степени окисления."
    },
    "electron_config": {
      "name_ru": "Электронная конфигурация",
      "description_ru": "Умение записывать электронную конфигурацию атома по его положению в таблице, составлять орбитальные диаграммы, определять валентные электроны. Знание принципа наименьшей энергии, правила Хунда, принципа Паули и случаев провала электрона."
    }
  }
}
